In [1]:
import pandas as pd
import seaborn as sns

#Apply

In [2]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df['ten'] = 10
print(df.head())

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [3]:
def add_5(n):
    return n + 5
def mpg_to_kpl(mpg):
    return mpg * 0.42514
def add_two_obj(a, b):
    return a + b

In [4]:
sr3 = df['ten'].apply(mpg_to_kpl)
print(sr3)

0      4.2514
1      4.2514
2      4.2514
3      4.2514
4      4.2514
        ...
886    4.2514
887    4.2514
888    4.2514
889    4.2514
890    4.2514
Name: ten, Length: 891, dtype: float64

In [5]:
sr1 = df['age'].apply(add_5)
print(sr1.head())
print(df['age'].head())

0    27.0
1    43.0
2    31.0
3    40.0
4    40.0
Name: age, dtype: float64
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [6]:

sr3 = df['age'].dropna().astype('int')
print(sr3)

0      22
1      38
2      26
3      35
4      35
       ..
885    39
886    27
887    19
889    26
890    32
Name: age, Length: 714, dtype: int32

In [7]:
sr2 = df['age'].apply(add_two_obj, b=10)
print(sr2.head())
print(type(sr2))

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64
<class 'pandas.core.series.Series'>

#Column Order

In [8]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [9]:
df = titanic.loc[0:4, 'survived':'age']
print(df)

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [10]:
print(df.columns.values)
print(type(df.columns.values))
print(type(df.columns))
columns = list(df.columns.values)
print(type(columns))

['survived' 'pclass' 'sex' 'age']
<class 'numpy.ndarray'>
<class 'pandas.core.indexes.base.Index'>
<class 'list'>

In [11]:
columns_sorted = sorted(columns, reverse=True)
print(columns_sorted)
df_sorted = df[columns_sorted]
print(df_sorted.head())

['survived', 'sex', 'pclass', 'age']
   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

In [12]:
columns_customed = ['pclass', 'sex', 'age', 'survived']
df_customed = df[columns_customed]
print(df_customed)

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

#Filter

In [14]:
df_teenage = titanic.loc[
    (titanic.age >= 10) & (titanic.age < 20)]
print(df_teenage)

     survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9           1       2  female  14.0      1      0   30.0708        C  Second
14          0       3  female  14.0      0      0    7.8542        S   Third
22          1       3  female  15.0      0      0    8.0292        Q   Third
27          0       1    male  19.0      3      2  263.0000        S   First
38          0       3  female  18.0      2      0   18.0000        S   Third
..        ...     ...     ...   ...    ...    ...       ...      ...     ...
853         1       1  female  16.0      0      1   39.4000        S   First
855         1       3  female  18.0      0      1    9.3500        S   Third
875         1       3  female  15.0      0      0    7.2250        C   Third
877         0       3    male  19.0      0      0    7.8958        S   Third
887         1       1  female  19.0      0      0   30.0000        S   First

       who  adult_male deck  embark_town alive  alone
9    child       False  NaN    Cherbourg   yes  False
14   child       False  NaN  Southampton    no   True
22   child       False  NaN   Queenstown   yes   True
27     man        True    C  Southampton    no  False
38   woman       False  NaN  Southampton    no  False
..     ...         ...  ...          ...   ...    ...
853  woman       False    D  Southampton   yes  False
855  woman       False  NaN  Southampton   yes  False
875  child       False  NaN    Cherbourg   yes   True
877    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True

[102 rows x 15 columns]

In [18]:
print(df_teenage.info())
print(df_teenage.survived.sum())
print(df_teenage.describe())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 102 entries, 9 to 887
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     102 non-null    int64
 1   pclass       102 non-null    int64
 2   sex          102 non-null    object
 3   age          102 non-null    float64
 4   sibsp        102 non-null    int64
 5   parch        102 non-null    int64
 6   fare         102 non-null    float64
 7   embarked     102 non-null    object
 8   class        102 non-null    category
 9   who          102 non-null    object
 10  adult_male   102 non-null    bool
 11  deck         19 non-null     category
 12  embark_town  102 non-null    object
 13  alive        102 non-null    object
 14  alone        102 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 10.4+ KB
None
41
         survived      pclass         age       sibsp       parch        fare
count  102.000000  102.000000  102.000000  102.000000  102.000000  102.000000
mean     0.401961    2.470588   16.779412    0.666667    0.470588   32.535132
std      0.492715    0.779767    2.263107    1.213238    0.779767   50.481289
min      0.000000    1.000000   10.000000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   16.000000    0.000000    0.000000    7.895800
50%      0.000000    3.000000   17.500000    0.000000    0.000000   11.500000
75%      1.000000    3.000000   18.000000    1.000000    1.000000   30.053100
max      1.000000    3.000000   19.000000    5.000000    3.000000  263.000000

In [26]:
df_female_under10 = titanic.loc[
    (titanic.age < 10) & (titanic.sex == 'female'), :]
print(df_female_under10.info())
print(df_female_under10.survived.sum())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 10 to 852
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     30 non-null     int64
 1   pclass       30 non-null     int64
 2   sex          30 non-null     object
 3   age          30 non-null     float64
 4   sibsp        30 non-null     int64
 5   parch        30 non-null     int64
 6   fare         30 non-null     float64
 7   embarked     30 non-null     object
 8   class        30 non-null     category
 9   who          30 non-null     object
 10  adult_male   30 non-null     bool
 11  deck         4 non-null      category
 12  embark_town  30 non-null     object
 13  alive        30 non-null     object
 14  alone        30 non-null     bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 3.4+ KB
None
19

In [27]:
df_under10_morethan60 = titanic.loc[
    (titanic.age < 10) | (titanic.age >= 60), :]
print(len(df_under10_morethan60))
print(df_under10_morethan60.survived.sum())

88
45

In [30]:
print(len(titanic))
print(titanic.survived.sum())

891
342

In [43]:
mask1 = titanic.sibsp == 2
mask2 = titanic.sibsp == 4
mask3 = titanic.sibsp == 5
df_boolean = titanic[(mask1 | mask2 | mask3) & (titanic.alive == 'yes')]
print(df_boolean.head())

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
68          1       3  female  17.0      4      2   7.9250        S   Third
183         1       2    male   1.0      2      1  39.0000        S  Second
233         1       3  female   5.0      4      2  31.3875        S   Third
261         1       3    male   3.0      4      2  31.3875        S   Third
301         1       3    male   NaN      2      0  23.2500        Q   Third

       who  adult_male deck  embark_town alive  alone
68   woman       False  NaN  Southampton   yes  False
183  child       False    F  Southampton   yes  False
233  child       False  NaN  Southampton   yes  False
261  child       False  NaN  Southampton   yes  False
301    man        True  NaN   Queenstown   yes  False

In [36]:
isin_filter = titanic.sibsp.isin([2,4,5])
df_isin = titanic[isin_filter]
print(df_isin.head())
print(df_isin.sibsp.unique())
print(df_isin.survived.sum())

    survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
16         0       3    male   2.0      4      1  29.1250        Q  Third
38         0       3  female  18.0      2      0  18.0000        S  Third
48         0       3    male   NaN      2      0  21.6792        C  Third
50         0       3    male   7.0      4      1  39.6875        S  Third
59         0       3    male  11.0      5      2  46.9000        S  Third

      who  adult_male deck  embark_town alive  alone
16  child       False  NaN   Queenstown    no  False
38  woman       False  NaN  Southampton    no  False
48    man        True  NaN    Cherbourg    no  False
50  child       False  NaN  Southampton    no  False
59  child       False  NaN  Southampton    no  False
[4 2 5]
16

#Concat

In [44]:
df1 = pd.DataFrame({
    'a':['a0','a1','a2','a3'],
    'b':['b0','b1','b2','b3'],
    'c':['c0','c1','c2','c3']},
    index=[0,1,2,3])
df2 = pd.DataFrame({
    'a':['a2','a3','a4','a5'],
    'b':['b2','b3','b4','b5'],
    'c':['c2','c3','c4','c5'],
    'd':['d2','d3','d4','d5']},
    index=[2,3,4,5])
print(df1)
print(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [45]:
result1 = pd.concat([df1, df2])
print(result1)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [54]:
print(result1.loc[2])
print(result1.iloc[2])

    a   b   c    d
2  a2  b2  c2  NaN
2  a2  b2  c2   d2
a     a2
b     b2
c     c2
d    NaN
Name: 2, dtype: object

In [49]:
result2 = pd.concat([df1, df2], ignore_index=True)
print(result2)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [55]:
print(result2.loc[2])
print(result2.iloc[2])

a     a2
b     b2
c     c2
d    NaN
Name: 2, dtype: object
a     a2
b     b2
c     c2
d    NaN
Name: 2, dtype: object

In [50]:
result3 = pd.concat([df1, df2], axis='columns')
print(result3)

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [58]:
result4 = pd.concat([df1, df2], axis=1, join='inner')
print(result4)

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [59]:
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name='e')
print(sr1)
result5 = pd.concat([df1, sr1], axis=1)
print(result5)

0    e0
1    e1
2    e2
3    e3
Name: e, dtype: object
    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

In [61]:
sr2 = pd.Series(['f0', 'f1', 'f2'], name='f', index=[4,3,5])
print(sr2)
result6 = pd.concat([df2, sr2], axis=1)
print(result6)

4    f0
3    f1
5    f2
Name: f, dtype: object
    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f1
4  a4  b4  c4  d4   f0
5  a5  b5  c5  d5   f2

In [62]:
result7 = pd.concat([sr1, sr2], axis=1)
print(result7)
print(type(result7))

     e    f
0   e0  NaN
1   e1  NaN
2   e2  NaN
3   e3   f1
4  NaN   f0
5  NaN   f2
<class 'pandas.core.frame.DataFrame'>

In [64]:
result8 = pd.concat([sr1, sr2], axis=0)
print(result8)
print(type(result8))

0    e0
1    e1
2    e2
3    e3
4    f0
3    f1
5    f2
dtype: object
<class 'pandas.core.series.Series'>

#Merge, Join

In [66]:
pd.set_option('display.unicode.east_asian_width', True)
pd.set_option('display.max_columns', 10)

In [67]:
df1 = pd.read_excel('../datasets/stock price.xlsx')
df2 = pd.read_excel('../datasets/stock valuation.xlsx')
print(df1)
print('=================================================')
print(df2)

       id    stock_name          value   price
0  128940      한미약품   59385.666667  421000
1  130960        CJ E&M   58540.666667   98900
2  138250    엔에스쇼핑   14558.666667   13200
3  139480        이마트  239230.833333  254500
4  142280  녹십자엠에스     468.833333   10200
5  145990        삼양사   82750.000000   82000
6  185750        종근당   40293.666667  100500
7  192400    쿠쿠홀딩스  179204.666667  177500
8  199800          툴젠   -2514.333333  115400
9  204210  모두투어리츠    3093.333333    3475
=================================================
       id              name           eps     bps        per       pbr
0  130960            CJ E&M   6301.333333   54068  15.695091  1.829178
1  136480              하림    274.166667    3551  11.489362  0.887074
2  138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
3  139480            이마트  18268.166667  295780  13.931338  0.860437
4  145990            삼양사   5741.000000  108090  14.283226  0.758627
5  161390        한국타이어   5648.500000   51341   7.453306  0.820007
6  181710   NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
7  185750            종근당   3990.333333   40684  25.185866  2.470259
8  204210      모두투어리츠     85.166667    5335  40.802348  0.651359
9  207940  삼성바이오로직스   4644.166667   60099  89.790059  6.938551

In [68]:
merge_inner = pd.merge(df1, df2)
print(merge_inner)

       id    stock_name          value   price          name           eps  \
0  130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
1  139480        이마트  239230.833333  254500        이마트  18268.166667
2  145990        삼양사   82750.000000   82000        삼양사   5741.000000
3  185750        종근당   40293.666667  100500        종근당   3990.333333
4  204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

      bps        per       pbr
0   54068  15.695091  1.829178
1  295780  13.931338  0.860437
2  108090  14.283226  0.758627
3   40684  25.185866  2.470259
4    5335  40.802348  0.651359

In [69]:
merge_outer = pd.merge(df1, df2, how='outer', on='id')
print(merge_outer)

        id    stock_name          value     price              name  \
0   128940      한미약품   59385.666667  421000.0               NaN
1   130960        CJ E&M   58540.666667   98900.0            CJ E&M
2   138250    엔에스쇼핑   14558.666667   13200.0               NaN
3   139480        이마트  239230.833333  254500.0            이마트
4   142280  녹십자엠에스     468.833333   10200.0               NaN
5   145990        삼양사   82750.000000   82000.0            삼양사
6   185750        종근당   40293.666667  100500.0            종근당
7   192400    쿠쿠홀딩스  179204.666667  177500.0               NaN
8   199800          툴젠   -2514.333333  115400.0               NaN
9   204210  모두투어리츠    3093.333333    3475.0      모두투어리츠
10  136480           NaN            NaN       NaN              하림
11  138040           NaN            NaN       NaN    메리츠금융지주
12  161390           NaN            NaN       NaN        한국타이어
13  181710           NaN            NaN       NaN   NHN엔터테인먼트
14  207940           NaN            NaN       NaN  삼성바이오로직스

             eps       bps        per       pbr
0            NaN       NaN        NaN       NaN
1    6301.333333   54068.0  15.695091  1.829178
2            NaN       NaN        NaN       NaN
3   18268.166667  295780.0  13.931338  0.860437
4            NaN       NaN        NaN       NaN
5    5741.000000  108090.0  14.283226  0.758627
6    3990.333333   40684.0  25.185866  2.470259
7            NaN       NaN        NaN       NaN
8            NaN       NaN        NaN       NaN
9      85.166667    5335.0  40.802348  0.651359
10    274.166667    3551.0  11.489362  0.887074
11   2122.333333   14894.0   6.313806  0.899691
12   5648.500000   51341.0   7.453306  0.820007
13   2110.166667   78434.0  30.755864  0.827447
14   4644.166667   60099.0  89.790059  6.938551

In [72]:
merge_left = pd.merge(df1, df2, how='left', on='id')
print(merge_left)

       id    stock_name          value   price          name           eps  \
0  128940      한미약품   59385.666667  421000           NaN           NaN
1  130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
2  138250    엔에스쇼핑   14558.666667   13200           NaN           NaN
3  139480        이마트  239230.833333  254500        이마트  18268.166667
4  142280  녹십자엠에스     468.833333   10200           NaN           NaN
5  145990        삼양사   82750.000000   82000        삼양사   5741.000000
6  185750        종근당   40293.666667  100500        종근당   3990.333333
7  192400    쿠쿠홀딩스  179204.666667  177500           NaN           NaN
8  199800          툴젠   -2514.333333  115400           NaN           NaN
9  204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

        bps        per       pbr
0       NaN        NaN       NaN
1   54068.0  15.695091  1.829178
2       NaN        NaN       NaN
3  295780.0  13.931338  0.860437
4       NaN        NaN       NaN
5  108090.0  14.283226  0.758627
6   40684.0  25.185866  2.470259
7       NaN        NaN       NaN
8       NaN        NaN       NaN
9    5335.0  40.802348  0.651359

In [73]:
merge_right = pd.merge(df1, df2, how='right', on='id')
print(merge_right)

       id    stock_name          value     price              name  \
0  130960        CJ E&M   58540.666667   98900.0            CJ E&M
1  136480           NaN            NaN       NaN              하림
2  138040           NaN            NaN       NaN    메리츠금융지주
3  139480        이마트  239230.833333  254500.0            이마트
4  145990        삼양사   82750.000000   82000.0            삼양사
5  161390           NaN            NaN       NaN        한국타이어
6  181710           NaN            NaN       NaN   NHN엔터테인먼트
7  185750        종근당   40293.666667  100500.0            종근당
8  204210  모두투어리츠    3093.333333    3475.0      모두투어리츠
9  207940           NaN            NaN       NaN  삼성바이오로직스

            eps     bps        per       pbr
0   6301.333333   54068  15.695091  1.829178
1    274.166667    3551  11.489362  0.887074
2   2122.333333   14894   6.313806  0.899691
3  18268.166667  295780  13.931338  0.860437
4   5741.000000  108090  14.283226  0.758627
5   5648.500000   51341   7.453306  0.820007
6   2110.166667   78434  30.755864  0.827447
7   3990.333333   40684  25.185866  2.470259
8     85.166667    5335  40.802348  0.651359
9   4644.166667   60099  89.790059  6.938551

In [74]:
price = df1[df1['price'] < 50000]
print(price)

       id    stock_name         value  price
2  138250    엔에스쇼핑  14558.666667  13200
4  142280  녹십자엠에스    468.833333  10200
9  204210  모두투어리츠   3093.333333   3475

In [75]:
value = pd.merge(price, df2)
print(value)

       id    stock_name        value  price          name        eps   bps  \
0  204210  모두투어리츠  3093.333333   3475  모두투어리츠  85.166667  5335

         per       pbr
0  40.802348  0.651359

In [76]:
value = pd.merge(df1[df1['price']<50000], df2)
print(value)

       id    stock_name        value  price          name        eps   bps  \
0  204210  모두투어리츠  3093.333333   3475  모두투어리츠  85.166667  5335

         per       pbr
0  40.802348  0.651359

In [77]:
df1.set_index('id', inplace=True)
df2.set_index('id', inplace=True)

In [78]:
df3 = df1.join(df2)
print(df3)

          stock_name          value   price          name           eps  \
id
128940      한미약품   59385.666667  421000           NaN           NaN
130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
138250    엔에스쇼핑   14558.666667   13200           NaN           NaN
139480        이마트  239230.833333  254500        이마트  18268.166667
142280  녹십자엠에스     468.833333   10200           NaN           NaN
145990        삼양사   82750.000000   82000        삼양사   5741.000000
185750        종근당   40293.666667  100500        종근당   3990.333333
192400    쿠쿠홀딩스  179204.666667  177500           NaN           NaN
199800          툴젠   -2514.333333  115400           NaN           NaN
204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

             bps        per       pbr
id
128940       NaN        NaN       NaN
130960   54068.0  15.695091  1.829178
138250       NaN        NaN       NaN
139480  295780.0  13.931338  0.860437
142280       NaN        NaN       NaN
145990  108090.0  14.283226  0.758627
185750   40684.0  25.185866  2.470259
192400       NaN        NaN       NaN
199800       NaN        NaN       NaN
204210    5335.0  40.802348  0.651359

In [79]:
df3 = df1.join(df2, how='inner')
print(df3)

          stock_name          value   price          name           eps  \
id
130960        CJ E&M   58540.666667   98900        CJ E&M   6301.333333
139480        이마트  239230.833333  254500        이마트  18268.166667
145990        삼양사   82750.000000   82000        삼양사   5741.000000
185750        종근당   40293.666667  100500        종근당   3990.333333
204210  모두투어리츠    3093.333333    3475  모두투어리츠     85.166667

           bps        per       pbr
id
130960   54068  15.695091  1.829178
139480  295780  13.931338  0.860437
145990  108090  14.283226  0.758627
185750   40684  25.185866  2.470259
204210    5335  40.802348  0.651359

In [80]:
df4 = df2.join(df1)
print(df4)

                    name           eps     bps        per       pbr  \
id
130960            CJ E&M   6301.333333   54068  15.695091  1.829178
136480              하림    274.166667    3551  11.489362  0.887074
138040    메리츠금융지주   2122.333333   14894   6.313806  0.899691
139480            이마트  18268.166667  295780  13.931338  0.860437
145990            삼양사   5741.000000  108090  14.283226  0.758627
161390        한국타이어   5648.500000   51341   7.453306  0.820007
181710   NHN엔터테인먼트   2110.166667   78434  30.755864  0.827447
185750            종근당   3990.333333   40684  25.185866  2.470259
204210      모두투어리츠     85.166667    5335  40.802348  0.651359
207940  삼성바이오로직스   4644.166667   60099  89.790059  6.938551

          stock_name          value     price
id
130960        CJ E&M   58540.666667   98900.0
136480           NaN            NaN       NaN
138040           NaN            NaN       NaN
139480        이마트  239230.833333  254500.0
145990        삼양사   82750.000000   82000.0
161390           NaN            NaN       NaN
181710           NaN            NaN       NaN
185750        종근당   40293.666667  100500.0
204210  모두투어리츠    3093.333333    3475.0
207940           NaN            NaN       NaN

#Group By

In [81]:
df = titanic.loc[:, ['age', 'sex', 'class',
                    'fare', 'survived']]
print('승객수 :', len(df))
print(df.head())

승객수 : 891
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [83]:
grouped = df.groupby(['class'])
print(grouped)
print(list(grouped))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000020ABE617E88>
[('First',       age     sex  class     fare  survived
1    38.0  female  First  71.2833         1
3    35.0  female  First  53.1000         1
6    54.0    male  First  51.8625         0
11   58.0  female  First  26.5500         1
23   28.0    male  First  35.5000         1
..    ...     ...    ...      ...       ...
871  47.0  female  First  52.5542         1
872  33.0    male  First   5.0000         0
879  56.0  female  First  83.1583         1
887  19.0  female  First  30.0000         1
889  26.0    male  First  30.0000         1

[216 rows x 5 columns]), ('Second',       age     sex   class     fare  survived
9    14.0  female  Second  30.0708         1
15   55.0  female  Second  16.0000         1
17    NaN    male  Second  13.0000         1
20   35.0    male  Second  26.0000         0
21   34.0    male  Second  13.0000         1
..    ...     ...     ...      ...       ...
866  27.0  female  Second  13.8583         1
874  28.0  female  Second  24.0000         1
880  25.0  female  Second  26.0000         1
883  28.0    male  Second  10.5000         0
886  27.0    male  Second  13.0000         0

[184 rows x 5 columns]), ('Third',       age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
2    26.0  female  Third   7.9250         1
4    35.0    male  Third   8.0500         0
5     NaN    male  Third   8.4583         0
7     2.0    male  Third  21.0750         0
..    ...     ...    ...      ...       ...
882  22.0  female  Third  10.5167         0
884  25.0    male  Third   7.0500         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0
890  32.0    male  Third   7.7500         0

[491 rows x 5 columns])]

In [84]:
grouped_df = {}
for key, group in grouped:
    print('key', key)
    print('승객수', len(group))
    grouped_df[key] = group
    print(group.head())

key First
승객수 216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1
key Second
승객수 184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1
key Third
승객수 491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [85]:
grouped_df['Third']

      age     sex  class     fare  survived
0    22.0    male  Third   7.2500         0
2    26.0  female  Third   7.9250         1
4    35.0    male  Third   8.0500         0
5     NaN    male  Third   8.4583         0
7     2.0    male  Third  21.0750         0
..    ...     ...    ...      ...       ...
882  22.0  female  Third  10.5167         0
884  25.0    male  Third   7.0500         0
885  39.0  female  Third  29.1250         0
888   NaN  female  Third  23.4500         0
890  32.0    male  Third   7.7500         0

[491 rows x 5 columns]

In [88]:
average = grouped.mean()
print(average)
print(type(average))

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363
<class 'pandas.core.frame.DataFrame'>

In [93]:
df_First = grouped.get_group('First')
print(df_First.head())

     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1

In [94]:
grouped_two = df.groupby(['class', 'sex'])
for key, group in grouped_two:
    print('key', key)
    print('승객수', len(group))
    print(group.head())

key ('First', 'female')
승객수 94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1
key ('First', 'male')
승객수 122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0
key ('Second', 'female')
승객수 76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1
key ('Second', 'male')
승객수 108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0
key ('Third', 'female')
승객수 144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0
key ('Third', 'male')
승객수 347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

In [95]:
average_two = grouped_two.mean()
print(average_two)
print(type(average_two))

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447
<class 'pandas.core.frame.DataFrame'>

In [96]:
group3f = grouped_two.get_group(('Third', 'female'))
print(group3f.head())

     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0

In [97]:
std_all = grouped.std()
print(std_all)

              age       fare  survived
class
First   14.802856  78.380373  0.484026
Second  14.001077  13.417399  0.500623
Third   12.495398  11.778142  0.428949

In [98]:
std_fare = grouped.std()['fare']
print(std_fare)

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [100]:
std_fare = grouped['fare'].std()
print(std_fare)

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [99]:
std_fare = grouped.fare.std()
print(std_fare)

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [102]:
agg_all = grouped.agg(['min', 'max', 'mean'])
print(agg_all)

         age                  fare                      survived
         min   max       mean  min       max       mean      min max      mean
class
First   0.92  80.0  38.233441  0.0  512.3292  84.154687        0   1  0.629630
Second  0.67  70.0  29.877630  0.0   73.5000  20.662183        0   1  0.472826
Third   0.42  74.0  25.140620  0.0   69.5500  13.675550        0   1  0.242363

In [104]:
agg_sep = grouped.agg({'fare':['min','max'], 'age':'mean'})
print(agg_sep)

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

#Multi index

In [105]:
print(average_two)

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [106]:
print(average_two.loc['First'])

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [107]:
print(average_two.loc['First', 'female'])

age          34.611765
fare        106.125798
survived      0.968085
Name: (First, female), dtype: float64

In [111]:
print(average_two.xs('female', level='sex'))

              age        fare  survived
class
First   34.611765  106.125798  0.968085
Second  28.722973   21.970121  0.921053
Third   21.750000   16.118810  0.500000

#Pivot table

In [112]:
print(df.head())

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [116]:
pdf1 = pd.pivot_table(df,
                     index='class',
                     columns='sex',
                     values='survived',
                     aggfunc='mean')
print(pdf1)

sex       female      male
class
First   0.968085  0.368852
Second  0.921053  0.157407
Third   0.500000  0.135447

In [117]:
pdf2 = pd.pivot_table(df,
                     index='class',
                     columns='sex',
                     values=['age', 'fare'],
                     aggfunc='mean')
print(pdf2)

              age                   fare
sex        female       male      female       male
class
First   34.611765  41.281386  106.125798  67.226127
Second  28.722973  30.740707   21.970121  19.741782
Third   21.750000  26.507589   16.118810  12.661633

In [118]:
pdf3 = pd.pivot_table(df,
                     index='class',
                     columns='sex',
                     values=['survived'],
                     aggfunc=['mean','sum', 'std'])
print(pdf3)

            mean                sum            std
        survived           survived       survived
sex       female      male   female male    female      male
class
First   0.968085  0.368852       91   45  0.176716  0.484484
Second  0.921053  0.157407       70   17  0.271448  0.365882
Third   0.500000  0.135447       72   47  0.501745  0.342694

In [119]:
pdf4 = pd.pivot_table(df,
         index=['class', 'sex'],
         columns='survived',
         values=['age', 'fare'],
         aggfunc=['mean', 'max'])
print(pdf4)

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0
       male    27.255814  22.274211   12.204469   15.579696  74.0  45.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875
       male     69.55   56.4958

In [120]:
print(pdf4.index)

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [122]:
print(pdf4.columns)

MultiIndex([('mean',  'age', 0),
            ('mean',  'age', 1),
            ('mean', 'fare', 0),
            ('mean', 'fare', 1),
            ( 'max',  'age', 0),
            ( 'max',  'age', 1),
            ( 'max', 'fare', 0),
            ( 'max', 'fare', 1)],
           names=[None, None, 'survived'])

In [124]:
print(pdf4.xs('First'))

               mean                                      max                \
                age                   fare               age          fare
survived          0          1           0           1     0     1       0
sex
female    25.666667  34.939024  110.604167  105.978159  50.0  63.0  151.55
male      44.581967  36.248000   62.894910   74.637320  71.0  80.0  263.00



survived         1
sex
female    512.3292
male      512.3292

In [125]:
print(pdf4.xs(('First', 'female')))

            survived
mean  age   0            25.666667
            1            34.939024
      fare  0           110.604167
            1           105.978159
max   age   0            50.000000
            1            63.000000
      fare  0           151.550000
            1           512.329200
Name: (First, female), dtype: float64

In [126]:
print(pdf4.xs('female',level='sex'))

               mean                                      max                \
                age                   fare               age          fare
survived          0          1           0           1     0     1       0
class
First     25.666667  34.939024  110.604167  105.978159  50.0  63.0  151.55
Second    36.000000  28.080882   18.250000   22.288989  57.0  55.0   26.00
Third     23.818182  19.329787   19.773093   12.464526  48.0  63.0   69.55



survived         1
class
First     512.3292
Second     65.0000
Third      31.3875

In [127]:
print(pdf4.xs('mean', axis=1))

                     age                   fare
survived               0          1           0           1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159
       male    44.581967  36.248000   62.894910   74.637320
Second female  36.000000  28.080882   18.250000   22.288989
       male    33.369048  16.022000   19.488965   21.095100
Third  female  23.818182  19.329787   19.773093   12.464526
       male    27.255814  22.274211   12.204469   15.579696

In [128]:
print(pdf4.xs(('mean', 'age'), axis=1))

survived               0          1
class  sex
First  female  25.666667  34.939024
       male    44.581967  36.248000
Second female  36.000000  28.080882
       male    33.369048  16.022000
Third  female  23.818182  19.329787
       male    27.255814  22.274211

In [129]:
print(pdf4.xs(1, level='survived', axis=1))

                    mean               max
                     age        fare   age      fare
class  sex
First  female  34.939024  105.978159  63.0  512.3292
       male    36.248000   74.637320  80.0  512.3292
Second female  28.080882   22.288989  55.0   65.0000
       male    16.022000   21.095100  62.0   39.0000
Third  female  19.329787   12.464526  63.0   31.3875
       male    22.274211   15.579696  45.0   56.4958

In [135]:
print(pdf4.xs(('max', 0,'fare'),
             level=[0, 'survived', 1], axis=1))

                  max
                 fare
survived            0
class  sex
First  female  151.55
       male    263.00
Second female   26.00
       male     73.50
Third  female   69.55
       male     69.55